from time import time

place = [
    [["教学楼"], ["A", "B", "C"], ["一楼", "二楼", "三楼", "四楼", "五楼"]],
    [["实训东楼"], ["A", "B"], ["一楼", "二楼", "三楼", "四楼", "五楼"]],
    [["男生公寓"], ["A", "B"], ["1", "2", "3"]],
    [["男生公寓"], ["F"], ["1", "2"]],
    [["男生公寓"], ["P"]],
    [["学生公寓C栋"]],
    [["女生公寓"], ["D", "E"], ["1", "2"]],
    [["学生服务中心"]],
    [["一", "二", "三", "四", "一", "二", "三", "四", "一", "二", "三", "一", "二", "一", "二"], ["食堂", "食堂"]],
    [["博雅长廊"]],
    [["学术报告厅"]],
    [["图文信息中心"], ["一楼", "二楼", "三楼"]],
    [["体育馆", "体育馆", "体育馆"]],
    [["实训西楼"]],
    [["行政楼"]],
    [["汀兰湖"]],
    [["荷塘"]],
    [["情人坡", "情人坡", "情人坡", "情人坡", "情人坡"]],
    [["操场", "操场", "操场", "操场", "操场", "操场", "操场", "操场", "操场", ]],
    [["西", "西", "西", "南"], ["门"]],
    [["立德", "体育", "荷塘", "立业", "达海", "通江"], ["路"]]
]


def get_len(place):
    count = 0
    for i in place:
        c = 1
        for j in i:
            c *= len(j)
        count += c
    return count


def get_love(user_id, sex=2):
    i = []
    timec = int(time())
    number = (timec // 86400) % 254 + 111
    day = user_id % number
    love_luck = day % get_len(place)
    for i in place:
        c = 1
        for j in i:
            c *= len(j)
        love_luck -= c
        if love_luck < 0:
            break
    str = ""
    for s in i:
        str += s[day % len(s)]

    gender = ["他", "她", "他/她"]
    msg = "\n今天 你未来的对象 可能会出现在 {}".format(str)
    return msg
